In [1]:
import numpy as np
import pandas as pd

#### Re-Indexing & Alerting labels

In [3]:
data = {
    'name' : ["Alice","Bob","Charlie"],
    'Age' : [25,36,16]
}

In [4]:
df = pd.DataFrame(data,index=['a','b','c'])
df

      name  Age
a    Alice   25
b      Bob   36
c  Charlie   16

In [5]:
df.reindex(['c','a','b'])

      name  Age
c  Charlie   16
a    Alice   25
b      Bob   36

In [6]:
df.reindex(['c','a','b','p'])

      name   Age
c  Charlie  16.0
a    Alice  25.0
b      Bob  36.0
p      NaN   NaN

In [7]:
df.reindex(['p','q','r'])

  name  Age
p  NaN  NaN
q  NaN  NaN
r  NaN  NaN

In [8]:
df

      name  Age
a    Alice   25
b      Bob   36
c  Charlie   16

In [9]:
df.reindex(columns=['Age','Name'])

   Age  Name
a   25   NaN
b   36   NaN
c   16   NaN

In [10]:
df.rename(index={'a':'p','c':'q'}, columns={'Name':'First Name','Age':'Current Age'})

      name  Current Age
p    Alice           25
b      Bob           36
q  Charlie           16

In [11]:
df

      name  Age
a    Alice   25
b      Bob   36
c  Charlie   16

##### Direcctly Replace Index or Column Labels

In [12]:
df.index = ['X','Y','Z']
df.columns = ['PersonName','PersonAge']

In [13]:
df

  PersonName  PersonAge
X      Alice         25
Y        Bob         36
Z    Charlie         16

In [14]:
print(df.index)

Index(['X', 'Y', 'Z'], dtype='object')

In [15]:
print(df.columns)

Index(['PersonName', 'PersonAge'], dtype='object')

In [16]:
df.reset_index(inplace=True)

In [17]:
df

  index PersonName  PersonAge
0     X      Alice         25
1     Y        Bob         36
2     Z    Charlie         16

In [19]:
df.drop(columns=['index'], inplace=True)

In [20]:
df

  PersonName  PersonAge
0      Alice         25
1        Bob         36
2    Charlie         16

#### Pivoting

In [8]:
data = {
    'Date' : ["2001-01-01","2001-01-01","2005-01-01","2005-01-01"],
    'Product' : ["Laptop","Mouse","Laptop","Mouse"],
    'Sales' : [1200,100,200,300]
}

df = pd.DataFrame(data)

In [9]:
df

         Date Product  Sales
0  2001-01-01  Laptop   1200
1  2001-01-01   Mouse    100
2  2005-01-01  Laptop    200
3  2005-01-01   Mouse    300

In [24]:
df.pivot(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2001-01-01    1200    100
2005-01-01     200    300

In [10]:
df.pivot(index="Product",columns="Date",values="Sales")

Date     2001-01-01  2005-01-01
Product
Laptop         1200         200
Mouse           100         300

In [11]:
df.pivot_table(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2001-01-01  1200.0  100.0
2005-01-01   200.0  300.0

In [12]:
df.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2001-01-01    1200    100
2005-01-01     200    300

In [17]:
data2 = {
    "Date" : ["2002-01-01","2002-01-01","2002-01-01","2010-01-01","2010-01-01","2010-01-01"],
    "Product" : ["Laptop","Mouse","Laptop","Mouse","Laptop","Mouse"],
    "Sales" : [300,540,6210,580,200,900]
}

df2 = pd.DataFrame(data2)

In [18]:
df2

         Date Product  Sales
0  2002-01-01  Laptop    300
1  2002-01-01   Mouse    540
2  2002-01-01  Laptop   6210
3  2010-01-01   Mouse    580
4  2010-01-01  Laptop    200
5  2010-01-01   Mouse    900

In [19]:
df2.pivot_table(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2002-01-01  3255.0  540.0
2010-01-01   200.0  740.0

In [20]:
df2.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="mean")

Product     Laptop  Mouse
Date
2002-01-01  3255.0  540.0
2010-01-01   200.0  740.0

In [21]:
df2.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2002-01-01    6510    540
2010-01-01     200   1480

In [22]:
df_trans = pd.read_csv("transactions.csv")

In [23]:
df_trans

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [25]:
df_trans.pivot_table(index="category",columns="name",values="amount",aggfunc="median")

name      Alice Brown   Bob Wilson  Charlie Davis   John Smith
category
A          1021.82313  1019.817320     960.214012   995.395288
B          1001.85037   986.140064     945.918499  1052.168773
C           991.35382   969.166379    1046.319932   975.563548

In [27]:
pvot_tbl = df_trans.pivot_table(index="category",columns="name",values="amount",aggfunc="count")

In [28]:
pvot_tbl

name      Alice Brown  Bob Wilson  Charlie Davis  John Smith
category
A                  50          65             68          77
B                  69          47             70          76
C                 133         107            129         114

In [29]:
print(pvot_tbl["Alice Brown"].sum())

252

In [30]:
for col in pvot_tbl.columns:
    print(f"{col} -> {pvot_tbl[col].sum()}")

Alice Brown -> 252
Bob Wilson -> 219
Charlie Davis -> 267
John Smith -> 267

##### Groupby() Function

In [2]:
data = {
    'Department' : ['IT','IT','HR','HR','Finance','Finance',],
    'Employee' : ['A','B','C','D','E','F'],
    'Salary' : [600000,515235,258369,951357,452136,800000]
}

df_hr = pd.DataFrame(data)
df_hr

  Department Employee  Salary
0         IT        A  600000
1         IT        B  515235
2         HR        C  258369
3         HR        D  951357
4    Finance        E  452136
5    Finance        F  800000

In [4]:
df_hr.groupby(by="Department")

In [5]:
df_hr.groupby(by="Department")['Salary']

In [6]:
df_hr.groupby(by=['Department','Employee'])['Salary'].mean()

Department  Employee
Finance     E           452136.0
            F           800000.0
HR          C           258369.0
            D           951357.0
IT          A           600000.0
            B           515235.0
Name: Salary, dtype: float64

In [7]:
df_hr.groupby(by='Department')['Salary'].agg(['sum','mean','count'])

                sum      mean  count
Department
Finance     1252136  626068.0      2
HR          1209726  604863.0      2
IT          1115235  557617.5      2

In [9]:
df_hr.groupby(by='Department')['Salary'].agg(Total_Sum = 'sum', Avg ='mean',Count = 'count')

            Total_Sum       Avg  Count
Department
Finance       1252136  626068.0      2
HR            1209726  604863.0      2
IT            1115235  557617.5      2

In [4]:
# Using groupbby().apply() with custom function

df = pd.DataFrame({
    'Team' : ['A','A','B','B','C','C'],
    'Palyer' : ['P1','P2','P3','P4','P5','P6'],
    'Score' : [15,25,1,6,5,46]
})

In [5]:
df

  Team Palyer  Score
0    A     P1     15
1    A     P2     25
2    B     P3      1
3    B     P4      6
4    C     P5      5
5    C     P6     46

In [6]:
def score_diff(x):
    return x.max() -x.min()

In [7]:
ans = df.groupby('Team')['Score'].apply(score_diff)

ans

Team
A    10
B     5
C    41
Name: Score, dtype: int64

In [8]:
# Filter groups with team total score > 35
total_score = df.groupby('Team')["Score"].sum()

high_score_teams = total_score[total_score > 39].index

filtered_df = df[df['Team'].isin(high_score_teams)]
filtered_df

  Team Palyer  Score
0    A     P1     15
1    A     P2     25
4    C     P5      5
5    C     P6     46

#### Transform()Function

In [9]:
df

  Team Palyer  Score
0    A     P1     15
1    A     P2     25
2    B     P3      1
3    B     P4      6
4    C     P5      5
5    C     P6     46

In [10]:
df['New_Score'] = df["Score"].transform(lambda x: x+5)

In [11]:
df

  Team Palyer  Score  New_Score
0    A     P1     15         20
1    A     P2     25         30
2    B     P3      1          6
3    B     P4      6         11
4    C     P5      5         10
5    C     P6     46         51

In [12]:
def disp(n):
    return n+10

df['Diff_Score'] = df['Score'].transform(disp)

In [13]:
df

  Team Palyer  Score  New_Score  Diff_Score
0    A     P1     15         20          25
1    A     P2     25         30          35
2    B     P3      1          6          11
3    B     P4      6         11          16
4    C     P5      5         10          15
5    C     P6     46         51          56

In [14]:
df.drop(columns=['New_Score','Diff_Score'], inplace=True)

In [15]:
df

  Team Palyer  Score
0    A     P1     15
1    A     P2     25
2    B     P3      1
3    B     P4      6
4    C     P5      5
5    C     P6     46

In [16]:
df['Avg_Score'] = df.groupby(by='Team')['Score'].transform('mean')

In [17]:
df.groupby(by='Team')['Score'].apply('mean')

Team
A    20.0
B     3.5
C    25.5
Name: Score, dtype: float64